status/2022/1209.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>02 December 2022 - 09 December 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">02 December 2022 - 09 December 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9c11801">1. MIT OCW</a>
<ul>
<li><a href="#orga1698f9">1.1. Done for the year.</a></li>
</ul>
</li>
<li><a href="#org4713da1">2. Mill Controller #2</a>
<ul>
<li><a href="#orge36f053">2.1. Mounted on display enclosure</a></li>
<li><a href="#org4dee30a">2.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orgdb5ebca">2.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org9779ece">2.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf9a247a">3. Alum Rock Data Center</a>
<ul>
<li><a href="#org282897e">3.1. need to check rocky, others? (arch?) for suitability</a></li>
<li><a href="#org3e4158b">3.2. recheck ALMA, now that CERN and Fermilab are using it</a></li>
</ul>
</li>
<li><a href="#orge83097b">4. OLPC</a>
<ul>
<li><a href="#orgdc4f1c4">4.1. Trish's OLPC battery fixed and OS updated.</a></li>
</ul>
</li>
<li><a href="#orgf760227">5. Virtual Orchestra</a>
<ul>
<li><a href="#org0217e37">5.1. sfz file tests</a>
<ul>
<li><a href="#org3c0116e">5.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org005a2ad">5.2. increasingly skeptical whether quality results are possible</a></li>
<li><a href="#orgf0e22a9">5.3. maybe should treat as platform for concatinative synthesis</a></li>
<li><a href="#org80d91ab">5.4. maybe should just accept the limitations and work with it</a></li>
</ul>
</li>
<li><a href="#org076f877">6. gat</a>
<ul>
<li><a href="#org5dc269c">6.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org2d32a68">7. RIOT drivers</a>
<ul>
<li><a href="#org8088d83">7.1. WS2801</a></li>
<li><a href="#org27727fa">7.2. Velleman KA03</a></li>
<li><a href="#org483bdb0">7.3. Velleman KA05</a></li>
</ul>
</li>
<li><a href="#orgfac69e8">8. mcd05 32 button/led box</a>
<ul>
<li><a href="#orgee7fe59">8.1. Recovered schematics.</a></li>
<li><a href="#org7bca966">8.2. Planning software.</a></li>
<li><a href="#org775ce77">8.3. Received STM32F767 Nucleo144 with Ethernet.</a>
<ul>
<li><a href="#org26470e7">8.3.1. Test program running.</a></li>
<li><a href="#org61e1f5d">8.3.2. Need to consider CoAP multicast discovery.</a></li>
<li><a href="#org9b4f8f3">8.3.3. Consider simpler architecture with STM32F767 as a 'hub'.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8ce1d31">9. AMD 2900 bitslice computing</a>
<ul>
<li><a href="#orge973ea2">9.1. Probably my oldest uncompleted project</a></li>
<li><a href="#orgfb87927">9.2. Exploring possibilities for something constructive</a></li>
</ul>
</li>
<li><a href="#orgc24b899">10. Hitachi HD68B09E CPU</a>
<ul>
<li><a href="#orgb8ec91d">10.1. RAM/UART/IO</a></li>
<li><a href="#org9fc4d07">10.2. Arduino Mega 2560 DMA loader</a></li>
<li><a href="#orgcfdcbb3">10.3. Generate quadrature clock directly</a></li>
<li><a href="#org7c11188">10.4. Full Bus SW Emulation infeasable</a></li>
</ul>
</li>
<li><a href="#org152a0f7">11. PLD programming</a></li>
<li><a href="#orgb62516d">12. More project ideas</a>
<ul>
<li><a href="#orgdd4ee12">12.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org9fe7c73">12.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#orgb63bc88">12.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#orge48684b">12.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org86cb273">12.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org9a1d913">12.3. GMPASM assembler</a></li>
<li><a href="#org567f2ea">12.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org0ff25f3">12.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#org7d98e68">12.5.1. Offline compilation</a></li>
<li><a href="#orgef9ac5d">12.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org19071a0">12.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org1b0a47d">12.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#orgf5aa55a">12.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org47c3408">12.6.3. CPUs with totally async bus may be supportable without RAM</a></li>
<li><a href="#orgc8be9d9">12.6.4. Use 5V Atmel CPU as boot loader controller</a></li>
<li><a href="#org3bb6a22">12.6.5. Could use small foorprint monitor in asm (gmpmon?)</a></li>
<li><a href="#org2cd871c">12.6.6. Started planning for HD68B09E.</a></li>
</ul>
</li>
<li><a href="#org620ace7">12.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#orgb2abfe2">12.7.1. OSI Superboard</a></li>
<li><a href="#orgb11e760">12.7.2. Super Jolt</a></li>
<li><a href="#org79f487c">12.7.3. Ampro Little Board</a></li>
<li><a href="#org6448b73">12.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgc2f712e">12.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc193d2f">13. David Davies</a>
<ul>
<li><a href="#org9d5fa64">13.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgc0e254a">13.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org36cc78b">13.3. Next hearing 12/15/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9c11801" class="outline-2">
<h2 id="org9c11801"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga1698f9" class="outline-3">
<h3 id="orga1698f9"><span class="section-number-3">1.1.</span> Done for the year.</h3>
</div>
</div>
<div id="outline-container-org4713da1" class="outline-2">
<h2 id="org4713da1"><span class="section-number-2">2.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge36f053" class="outline-3">
<h3 id="orge36f053"><span class="section-number-3">2.1.</span> Mounted on display enclosure</h3>
</div>
<div id="outline-container-org4dee30a" class="outline-3">
<h3 id="org4dee30a"><span class="section-number-3">2.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgdb5ebca" class="outline-4">
<h4 id="orgdb5ebca"><span class="section-number-4">2.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org9779ece" class="outline-4">
<h4 id="org9779ece"><span class="section-number-4">2.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf9a247a" class="outline-2">
<h2 id="orgf9a247a"><span class="section-number-2">3.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org282897e" class="outline-3">
<h3 id="org282897e"><span class="section-number-3">3.1.</span> need to check rocky, others? (arch?) for suitability</h3>
</div>
<div id="outline-container-org3e4158b" class="outline-3">
<h3 id="org3e4158b"><span class="section-number-3">3.2.</span> recheck ALMA, now that CERN and Fermilab are using it</h3>
</div>
</div>
<div id="outline-container-orge83097b" class="outline-2">
<h2 id="orge83097b"><span class="section-number-2">4.</span> OLPC</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgdc4f1c4" class="outline-3">
<h3 id="orgdc4f1c4"><span class="section-number-3">4.1.</span> Trish's OLPC battery fixed and OS updated.</h3>
</div>
</div>
<div id="outline-container-orgf760227" class="outline-2">
<h2 id="orgf760227"><span class="section-number-2">5.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0217e37" class="outline-3">
<h3 id="org0217e37"><span class="section-number-3">5.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org3c0116e" class="outline-4">
<h4 id="org3c0116e"><span class="section-number-4">5.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org005a2ad" class="outline-3">
<h3 id="org005a2ad"><span class="section-number-3">5.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
<div id="outline-container-orgf0e22a9" class="outline-3">
<h3 id="orgf0e22a9"><span class="section-number-3">5.3.</span> maybe should treat as platform for concatinative synthesis</h3>
</div>
<div id="outline-container-org80d91ab" class="outline-3">
<h3 id="org80d91ab"><span class="section-number-3">5.4.</span> maybe should just accept the limitations and work with it</h3>
<div class="outline-text-3" id="text-5-4">
<p>
One should not be disappointed that a guitar can't sound like a flute.
</p>
</div>
</div>
</div>
<div id="outline-container-org076f877" class="outline-2">
<h2 id="org076f877"><span class="section-number-2">6.</span> gat</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org5dc269c" class="outline-3">
<h3 id="org5dc269c"><span class="section-number-3">6.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org2d32a68" class="outline-2">
<h2 id="org2d32a68"><span class="section-number-2">7.</span> RIOT drivers</h2>
<div class="outline-text-2" id="text-7">
<p>
Implemented - needs testing.
</p>
</div>
<div id="outline-container-org8088d83" class="outline-3">
<h3 id="org8088d83"><span class="section-number-3">7.1.</span> WS2801</h3>
</div>
<div id="outline-container-org27727fa" class="outline-3">
<h3 id="org27727fa"><span class="section-number-3">7.2.</span> Velleman KA03</h3>
</div>
<div id="outline-container-org483bdb0" class="outline-3">
<h3 id="org483bdb0"><span class="section-number-3">7.3.</span> Velleman KA05</h3>
</div>
</div>
<div id="outline-container-orgfac69e8" class="outline-2">
<h2 id="orgfac69e8"><span class="section-number-2">8.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgee7fe59" class="outline-3">
<h3 id="orgee7fe59"><span class="section-number-3">8.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org7bca966" class="outline-3">
<h3 id="org7bca966"><span class="section-number-3">8.2.</span> Planning software.</h3>
</div>
<div id="outline-container-org775ce77" class="outline-3">
<h3 id="org775ce77"><span class="section-number-3">8.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-org26470e7" class="outline-4">
<h4 id="org26470e7"><span class="section-number-4">8.3.1.</span> Test program running.</h4>
</div>
<div id="outline-container-org61e1f5d" class="outline-4">
<h4 id="org61e1f5d"><span class="section-number-4">8.3.2.</span> Need to consider CoAP multicast discovery.</h4>
</div>
<div id="outline-container-org9b4f8f3" class="outline-4">
<h4 id="org9b4f8f3"><span class="section-number-4">8.3.3.</span> Consider simpler architecture with STM32F767 as a 'hub'.</h4>
</div>
</div>
</div>
<div id="outline-container-org8ce1d31" class="outline-2">
<h2 id="org8ce1d31"><span class="section-number-2">9.</span> AMD 2900 bitslice computing</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orge973ea2" class="outline-3">
<h3 id="orge973ea2"><span class="section-number-3">9.1.</span> Probably my oldest uncompleted project</h3>
</div>
<div id="outline-container-orgfb87927" class="outline-3">
<h3 id="orgfb87927"><span class="section-number-3">9.2.</span> Exploring possibilities for something constructive</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Create verilog models for 2903/2910 and verify against hardware?
</p>
</div>
</div>
</div>
<div id="outline-container-orgc24b899" class="outline-2">
<h2 id="orgc24b899"><span class="section-number-2">10.</span> Hitachi HD68B09E CPU</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgb8ec91d" class="outline-3">
<h3 id="orgb8ec91d"><span class="section-number-3">10.1.</span> RAM/UART/IO</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Maybe have a standard peripheral set for 8 bit CPU bringups
</p>
</div>
</div>
<div id="outline-container-org9fc4d07" class="outline-3">
<h3 id="org9fc4d07"><span class="section-number-3">10.2.</span> Arduino Mega 2560 DMA loader</h3>
<div class="outline-text-3" id="text-10-2">
<p>
&#x2026;Along with standard 8 bit loader
</p>
</div>
</div>
<div id="outline-container-orgcfdcbb3" class="outline-3">
<h3 id="orgcfdcbb3"><span class="section-number-3">10.3.</span> Generate quadrature clock directly</h3>
</div>
<div id="outline-container-org7c11188" class="outline-3">
<h3 id="org7c11188"><span class="section-number-3">10.4.</span> Full Bus SW Emulation infeasable</h3>
<div class="outline-text-3" id="text-10-4">
<p>
6809 1000ns maximum cycle time too short
</p>
</div>
</div>
</div>
<div id="outline-container-org152a0f7" class="outline-2">
<h2 id="org152a0f7"><span class="section-number-2">11.</span> PLD programming</h2>
<div class="outline-text-2" id="text-11">
<p>
Looks like Atmel 16V8 is the last 5V PLD part left standing. Maybe not
surprising that there still doesn't appear to be a fully open source
tool chain for programming. How hard could it be? (!) Could next-pnr
generic help? Might be easier to use espresso for logic array and program
output logic bits directly for simple stuff.
</p>
</div>
</div>
<div id="outline-container-orgb62516d" class="outline-2">
<h2 id="orgb62516d"><span class="section-number-2">12.</span> More project ideas</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgdd4ee12" class="outline-3">
<h3 id="orgdd4ee12"><span class="section-number-3">12.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-org9fe7c73" class="outline-3">
<h3 id="org9fe7c73"><span class="section-number-3">12.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-12-2">
</div>
<div id="outline-container-orgb63bc88" class="outline-4">
<h4 id="orgb63bc88"><span class="section-number-4">12.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-orge48684b" class="outline-4">
<h4 id="orge48684b"><span class="section-number-4">12.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-12-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-org86cb273" class="outline-4">
<h4 id="org86cb273"><span class="section-number-4">12.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org9a1d913" class="outline-3">
<h3 id="org9a1d913"><span class="section-number-3">12.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-12-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-org567f2ea" class="outline-3">
<h3 id="org567f2ea"><span class="section-number-3">12.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org0ff25f3" class="outline-3">
<h3 id="org0ff25f3"><span class="section-number-3">12.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-12-5">
</div>
<div id="outline-container-org7d98e68" class="outline-4">
<h4 id="org7d98e68"><span class="section-number-4">12.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-orgef9ac5d" class="outline-4">
<h4 id="orgef9ac5d"><span class="section-number-4">12.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org19071a0" class="outline-3">
<h3 id="org19071a0"><span class="section-number-3">12.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-12-6">
</div>
<div id="outline-container-org1b0a47d" class="outline-4">
<h4 id="org1b0a47d"><span class="section-number-4">12.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-orgf5aa55a" class="outline-4">
<h4 id="orgf5aa55a"><span class="section-number-4">12.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org47c3408" class="outline-4">
<h4 id="org47c3408"><span class="section-number-4">12.6.3.</span> CPUs with totally async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-orgc8be9d9" class="outline-4">
<h4 id="orgc8be9d9"><span class="section-number-4">12.6.4.</span> Use 5V Atmel CPU as boot loader controller</h4>
</div>
<div id="outline-container-org3bb6a22" class="outline-4">
<h4 id="org3bb6a22"><span class="section-number-4">12.6.5.</span> Could use small foorprint monitor in asm (gmpmon?)</h4>
</div>
<div id="outline-container-org2cd871c" class="outline-4">
<h4 id="org2cd871c"><span class="section-number-4">12.6.6.</span> Started planning for HD68B09E.</h4>
</div>
</div>
<div id="outline-container-org620ace7" class="outline-3">
<h3 id="org620ace7"><span class="section-number-3">12.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-12-7">
</div>
<div id="outline-container-orgb2abfe2" class="outline-4">
<h4 id="orgb2abfe2"><span class="section-number-4">12.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-12-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-orgb11e760" class="outline-4">
<h4 id="orgb11e760"><span class="section-number-4">12.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-12-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org79f487c" class="outline-4">
<h4 id="org79f487c"><span class="section-number-4">12.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-12-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org6448b73" class="outline-4">
<h4 id="org6448b73"><span class="section-number-4">12.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-12-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
</p>
</div>
</div>
<div id="outline-container-orgc2f712e" class="outline-4">
<h4 id="orgc2f712e"><span class="section-number-4">12.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-12-7-5">
<p>
Works. Found original prom in a parts stash(!).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc193d2f" class="outline-2">
<h2 id="orgc193d2f"><span class="section-number-2">13.</span> David Davies</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org9d5fa64" class="outline-3">
<h3 id="org9d5fa64"><span class="section-number-3">13.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgc0e254a" class="outline-3">
<h3 id="orgc0e254a"><span class="section-number-3">13.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org36cc78b" class="outline-3">
<h3 id="org36cc78b"><span class="section-number-3">13.3.</span> Next hearing 12/15/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>